---
layout: default
title: "Антон Водясов | Junior Python Developer"
---

# Антон Водясов | Junior Python Developer

Добро пожаловать в мое профессиональное портфолио. Я начинающий Python-разработчик с опытом в аналитике данных, разработке ботов и веб-приложений. Мой опыт работы в правоохранительных органах и навыки OSINT помогают мне эффективно анализировать и обрабатывать данные, что делает меня ценным специалистом для современных IT-проектов.

---

## 🛠️ Навыки

- **Языки программирования**: Python, SQL
- **Фреймворки**: Django, Flask, FastAPI
- **Инструменты**: Git, VS Code, Linux, Nginx
- **Аналитические навыки**: OSINT, анализ данных, интерпретация данных
- **Мягкие навыки**: Ответственность, внимание к деталям, адаптивность, ориентация на результат

---

## 📂 Проекты

### [The Battle of Heroes](https://github.com/ANVod/The-Battle-of-Heroes)
Консольная игра на Python, демонстрирующая использование алгоритмов и логики для создания игровых механик.

### [FinAssistant Bot](https://github.com/ANVod/PassTGBot)
Телеграм-бот для учета личных финансов, позволяющий пользователям отслеживать свои расходы по категориям. 

### [Flower Delivery](https://github.com/ANVod/Project_development_and_website_deployment_on_hosting)
Веб-приложение для онлайн-заказа цветов, с функцией оформления заказа и отправки уведомлений через Telegram.

---

## 📞 Контакты

- **Telegram**: [@OSINT_AVDetective](https://t.me/OSINT_AVDetective)
- **Email**: [ya@vodyasov.ru](mailto:ya@vodyasov.ru)
- **GitHub**: [ANVod](https://github.com/ANVod)

---

Спасибо, что посетили мое портфолио! Здесь вы можете ознакомиться с моими проектами, изучить код и узнать больше о моих навыках. Я открыт для новых возможностей и готов к сотрудничеству на интересных IT-проектах.
